{
    "games": [
      {
        "name": "Chess",
        "rules": [
            {
            "rule": "Objective",
            "description": "The goal is to capture all of the opponent's pieces or block them so they cannot move."
            },
            {
            "rule": "The Board",
            "description": "The board is a 10x10 grid with 50 dark squares and 50 light squares. The game is played only on the dark squares."
            },
            {
            "rule": "Starting Setup",
            "description": "Each player has 20 pieces, placed on the first 4 rows of dark squares on each player's side of the board."
            },
            {
            "rule": "Movement - Regular Pieces",
            "description": "Regular pieces (Men) move diagonally forward one square to an empty dark square. They cannot move backward unless capturing."
            },
            {
            "rule": "Movement - Kings",
            "description": "Kings move diagonally any number of squares (both forward and backward), provided the path is unobstructed."
            },
            {
            "rule": "Capturing - Mandatory Capture",
            "description": "If a player can capture an opponent's piece, they must do so. Captures are mandatory."
            },
            {
            "rule": "Capturing - Jumping",
            "description": "Captures are made by jumping over an opponent's piece to an empty square directly on the other side. Multiple captures are allowed in a single turn if possible."
            },
            {
            "rule": "Capturing - Direction",
            "description": "Regular pieces can only capture forward diagonally. Kings can capture forward or backward diagonally."
            },
            {
            "rule": "Capturing - Removing Pieces",
            "description": "Captured pieces are removed from the board after the capturing move is complete."
            },
            {
            "rule": "Promotion to King",
            "description": "A regular piece is promoted to a King when it reaches the opponent's back row. Promotion happens at the end of the move."
            },
            {
            "rule": "Winning - Win Conditions",
            "description": "A player wins if they capture all the opponent's pieces or if the opponent has no legal moves left."
            },
            {
            "rule": "Winning - Draw",
            "description": "The game ends in a draw if neither player can force a win, or if the same position repeats three times."
            },
            {
            "rule": "Advanced - Multiple Capture Priority",
            "description": "If multiple capturing options exist, players are free to choose any sequence of captures."
            },
            {
            "rule": "Advanced - Equal Priority Rule",
            "description": "A King and a regular piece have equal priority in terms of mandatory capture."
            },
            {
            "rule": "Advanced - Counting Moves for Draw",
            "description": "If no pieces are captured in 25 consecutive moves by either player, the game is declared a draw."
            },
            {
            "rule": "Etiquette",
            "description": "Players should not distract or interfere with their opponent. Moves must be clear and deliberate."
            }
        ]
      }   
    ]
  }
  